<a href="https://colab.research.google.com/github/2303A51680/b23_1680/blob/main/Lab_04(cw).ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd
data=[10,20,30,40,50]
series=pd.Series(data)
print("Pandas Series")
print(series)

Pandas Series
0    10
1    20
2    30
3    40
4    50
dtype: int64

series with custom index

In [2]:
import pandas as pd
data=[10,20,30,40,50]
index_labels=['a','b','c','d','e']
series=pd.Series(data,index=index_labels)
print("Pandas Series")
print(series)

Pandas Series
a    10
b    20
c    30
d    40
e    50
dtype: int64

creating a dataframe

In [3]:
import pandas as pd
data={
    'name':['alice','bob','charlie','david'],
    'age':[25,30,35,40],
    'city':['hyderabad','delhi','chennai','mumbai']
}
df=pd.DataFrame(data)
print(df)

      name  age       city
0    alice   25  hyderabad
1      bob   30      delhi
2  charlie   35    chennai
3    david   40     mumbai

basic dataframe operations a) accessing data

In [4]:
print(df['name'])
print(df[['name','city']])
print(df.iloc[1])
print(df.loc[2])

0      alice
1        bob
2    charlie
3      david
Name: name, dtype: object
      name       city
0    alice  hyderabad
1      bob      delhi
2  charlie    chennai
3    david     mumbai
name      bob
age        30
city    delhi
Name: 1, dtype: object
name    charlie
age          35
city    chennai
Name: 2, dtype: object

b) adding a new column

In [5]:
df['salary']=[40000,50000,60000,70000]
print(df)

      name  age       city  salary
0    alice   25  hyderabad   40000
1      bob   30      delhi   50000
2  charlie   35    chennai   60000
3    david   40     mumbai   70000

removing a column

In [6]:
df=df.drop('city',axis=1)
print(df)

      name  age  salary
0    alice   25   40000
1      bob   30   50000
2  charlie   35   60000
3    david   40   70000

d) filtering data

In [7]:
print(df[df['age']>30])

      name  age  salary
2  charlie   35   60000
3    david   40   70000

e) basic statistics

In [8]:
print(df['age'].mean())
print(df['age'].max())
print(df['age'].min())

32.5
40
25

real world examples: student data

In [9]:
import pandas as pd
Student_data={
    'Student_ID':[101,102,103,104,],
    'Name':['jaya','pooji','likki','vaibha'],
    'Marks':[28,23,9,26],
    'Department':['CSE','ECE','MECH','EEE']
}
df=pd.DataFrame(Student_data)
print("Student Data")
print(df)

Student Data
   Student_ID    Name  Marks Department
0         101    jaya     28        CSE
1         102   pooji     23        ECE
2         103   likki      9       MECH
3         104  vaibha     26        EEE

In [10]:
print("\nStudent with Marks>20:")
print(df[df["Marks"]>20])

Student with Marks>20:
   Student_ID    Name  Marks Department
0         101    jaya     28        CSE
1         102   pooji     23        ECE
3         104  vaibha     26        EEE

In [11]:
print("\nAverage Marks:",df['Marks'].mean())

Average Marks: 21.5

In [12]:
df['Result']=['pass'if x>20 else 'fail' for x in df['Marks']]
print("\nStudent Result column:")
print(df)

Student Result column:
   Student_ID    Name  Marks Department Result
0         101    jaya     28        CSE   pass
1         102   pooji     23        ECE   pass
2         103   likki      9       MECH   fail
3         104  vaibha     26        EEE   pass